package com.openfinteacher.man.data.models

import com.openfinteacher.man.R

val quiz_1_result = listOf(
    QuizResult(
        image = R.drawable.quiz_1_picture_result_good,
        isRight = true,
        resume = "Ваш результат показывает, что вы обладаете хорошим пониманием основ финансовой грамотности и умеете эффективно планировать свой бюджет. Продолжайте в том же духе, сохраняйте дисциплину в финансовых вопросах и стремитесь к постоянному улучшению своих навыков."
    ),

    QuizResult(
        image = R.drawable.quiz_1_picture_result_bad,
        isRight = false,
        resume = "Ваш результат показывает, что есть некоторые пробелы в понимании основ финансовой грамотности и планировании бюджета. Не беспокойтесь, это отличное время начать изучение и улучшение своих финансовых навыков. Попробуйте пересмотреть материалы еще раз и обратить внимание на области, в которых вам нужно больше практики и изучения."
    )
)

val quiz_2_result = listOf(
    QuizResult(
        image = R.drawable.quiz_2_picture_result_good,
        isRight = true,
        resume = "Ваш результат показывает, что вы обладаете хорошим пониманием основ инвестирования в недвижимость и основных стратегий. Вы готовы эффективно принимать решения и разрабатывать планы для успешных инвестиций в недвижимость. Продолжайте развивать свои знания и навыки в этой области, чтобы добиться еще больших успехов!"
    ),

    QuizResult(
        image = R.drawable.quiz_2_picture_result_bad,
        isRight = false,
        resume = "Ваш результат показывает, что есть некоторые пробелы в понимании основ инвестирования в недвижимость и стратегий, связанных с этим. Не волнуйтесь, это нормально — инвестирование в недвижимость может быть сложной темой. Рекомендуется уделить больше времени изучению материалов и примеров, чтобы лучше понять принципы и стратегии инвестирования в недвижимость"
    )
)

val quiz_3_result = listOf(
    QuizResult(
        image = R.drawable.quiz_3_picture_result_good,
        isRight = true,
        resume = "Ваш результат показывает, что вы обладаете хорошим пониманием основ фондового рынка и стратегий инвестирования в акции. Вы готовы к началу инвестирования и принятия осознанных финансовых решений. Продолжайте обучение и практику, чтобы добиться еще больших успехов на фондовом рынке!"
    ),

    QuizResult(
        image = R.drawable.quiz_3_picture_result_bad,
        isRight = false,
        resume = "Ваш результат показывает, что есть некоторые пробелы в понимании основ фондового рынка и инвестирования в акции. Не расстраивайтесь — фондовый рынок может быть сложной темой для понимания. Рекомендуется уделить больше времени на изучение материалов и возможно обратиться к дополнительным источникам информации, чтобы улучшить свои знания и навыки в этой области."
    )
)

val quiz_4_result = listOf(
    QuizResult(
        image = R.drawable.quiz_4_picture_result_good,
        isRight = true,
        resume = "Ваш результат показывает, что вы обладаете хорошим пониманием принципов диверсификации портфеля и стратегий снижения рисков в инвестициях. Вы готовы к осуществлению диверсифицированных инвестиций и умеете принимать осознанные финансовые решения. Продолжайте развивать свои знания в этой области."
    ),

    QuizResult(
        image = R.drawable.quiz_4_picture_result_bad,
        isRight = false,
        resume = "Ваш результат показывает, что есть некоторые пробелы в понимании принципов диверсификации портфеля и стратегий снижения рисков в инвестициях. Не расстраивайтесь — диверсификация портфеля может быть сложной темой для понимания. Рекомендуется уделить больше времени на изучение материалов и возможно обратиться к дополнительным источникам информации."
    )
)

val quiz_5_result = listOf(
    QuizResult(
        image = R.drawable.quiz_5_picture_result_good,
        isRight = true,
        resume = "Ваш результат показывает, что вы обладаете хорошим пониманием основ планирования пенсионных накоплений и стратегий для достижения этой цели. Вы готовы к эффективному управлению своими финансами и созданию надежной финансовой базы для будущей пенсии. Продолжайте развивать свои знания и навыки в этой области."
    ),

    QuizResult(
        image = R.drawable.quiz_5_picture_result_bad,
        isRight = false,
        resume = "Ваш результат показывает, что есть некоторые пробелы в понимании основ планирования пенсионных накоплений и стратегий для достижения этой цели. Не расстраивайтесь — пенсионные накопления могут быть сложной темой для понимания. Рекомендуется уделить больше времени на изучение материалов и возможно обратиться к финансовым консультантам, чтобы улучшить свои знания и навыки в этой области."
    )
)